from data_prep.greek_data_prep.sentence_tokenization import my_split

def test_my_split():
    # it should correctly tokenize strings with intermediate semicola
    input_list_0 = ['Τίνες αἱ γενικαὶ τῶν σχημάτων διαφοραί; Τῶν δὲ σχημάτων ἃ μέν ἐστιν ἐπίπεδα, ἃ δὲ στερεά, κ. τ. λ.', 'Τί τὸ ἀμβλυγώνιον; Ἀμβλυγώνιον δὲ τὸ μίαν ἔχον ἀμβλεῖαν γωνίαν.']
    output_0 = ['Τίνες αἱ γενικαὶ τῶν σχημάτων διαφοραί;', 'Τῶν δὲ σχημάτων ἃ μέν ἐστιν ἐπίπεδα, ἃ δὲ στερεά, κ. τ. λ.', 'Τί τὸ ἀμβλυγώνιον;', 'Ἀμβλυγώνιον δὲ τὸ μίαν ἔχον ἀμβλεῖαν γωνίαν.']
    assert my_split(input_list_0, ';') == output_0

    # it should correctly tokenize strings with multiple semicola
    input_list_1 = ['καὶ τίς ἰσχύσει οἰκοδομῆσαι αὐτῷ οἶκου; ὅτι ὁ οὐρανὸς καὶ ὁ οὐρανὸς τοῦ οὐρανοῦ οὐ φέρουσιν αὐτοῦ τὴν δόξαν· καὶ τίς ἐγὼ οἰκοδομῶν αὐτῷ οἶκον ; ὅτι ἀλλ ἢ τοῦ θυμιῶν κατέναντι αὐτοῦ.']
    output_1 = ['καὶ τίς ἰσχύσει οἰκοδομῆσαι αὐτῷ οἶκου;','ὅτι ὁ οὐρανὸς καὶ ὁ οὐρανὸς τοῦ οὐρανοῦ οὐ φέρουσιν αὐτοῦ τὴν δόξαν· καὶ τίς ἐγὼ οἰκοδομῶν αὐτῷ οἶκον ;','ὅτι ἀλλ ἢ τοῦ θυμιῶν κατέναντι αὐτοῦ.']
    assert my_split(input_list_1, ';') == output_1

    # it should correctly tokenize strings with a final semicolon
    input_list_2 = ['ἢ μή τις ὕμνος Βακχίῳ κωμάζεται;']
    output_2 = ['ἢ μή τις ὕμνος Βακχίῳ κωμάζεται;']
    assert my_split(input_list_2, ';') == output_2

    # it should correctly tokenize strings with an initial semicolon (why are there present at all?)
    input_list_3 = ['; Ποινῶν καὶ Σικελιωτῶν τὴν κατὰ Ῥωμαίων συμμαχίαν ἑτοιμαζόντων, Μέτελλος στρατηγὸς μόνῃ τῇ Ἑστίᾳ οὐκ ἔθυσεν· ἡ δὲ πνεῦμα ἀντέπνευσε ταῖς ναυσί.']
    output_3 = [';', 'Ποινῶν καὶ Σικελιωτῶν τὴν κατὰ Ῥωμαίων συμμαχίαν ἑτοιμαζόντων, Μέτελλος στρατηγὸς μόνῃ τῇ Ἑστίᾳ οὐκ ἔθυσεν· ἡ δὲ πνεῦμα ἀντέπνευσε ταῖς ναυσί.']
    assert my_split(input_list_3, ';') == output_3

    # it should correctly tokenize string without the seperator
    input_list_4 = ['Ἔστω τμᾶμα οἷον εἴρηται, καὶ ἀφεθὲν ἐς τὸ ὑγρὸν καθάπερ ἐρρέθη καθεστακέτω οὕτως, ὥστε τὰν βάσιν αὐτοῦ ἅπτεσθαι τᾶς τοῦ ὑγροῦ ἐπιφανείας.', 'Δεικτέον ὅτι οὐ μενεῖ, ἀλλὰ ἀνακλιθήσεται οὕτως, ὥστε τὰν βάσιν αὐτοῦ μηδὲ καθʼ ἓν ἅπτεσθαι τᾶς τοῦ ὑγροῦ ἐπιφανείας.']
    output_4 = ['Ἔστω τμᾶμα οἷον εἴρηται, καὶ ἀφεθὲν ἐς τὸ ὑγρὸν καθάπερ ἐρρέθη καθεστακέτω οὕτως, ὥστε τὰν βάσιν αὐτοῦ ἅπτεσθαι τᾶς τοῦ ὑγροῦ ἐπιφανείας.', 'Δεικτέον ὅτι οὐ μενεῖ, ἀλλὰ ἀνακλιθήσεται οὕτως, ὥστε τὰν βάσιν αὐτοῦ μηδὲ καθʼ ἓν ἅπτεσθαι τᾶς τοῦ ὑγροῦ ἐπιφανείας.']
    assert my_split(input_list_4, ';') == output_4

    # it should correctly tokenize string with middle dots
    input_list_5 = ['Ἁ δὲ ΜΓ τᾷ ΦΧ ἴσα · δῆλον οὖν ὅτι μείζων ἢ ἡμιολία ἁ ΠΜ τᾶς ΠΗ, ἁ δὲ ΠΗ ἐλάσσων ἢ διπλασίων τᾶς ΗΜ Ἔστω οὖν ἁ ΠΖ τᾶς ΖΜ διπλασία.', 'οὕτως δὲ ἔχει καὶ ἡ ἀκοὴ περὶ τοὺς ψόφους· δεῖ γὰρ αὐτήν τε ὑγιαίνειν καὶ τὸ μεταξὺ ἠρεμοῦν εἶναι καὶ τὸ διάστημα σύμμετρον.']
    output_5 = ['Ἁ δὲ ΜΓ τᾷ ΦΧ ἴσα ·', 'δῆλον οὖν ὅτι μείζων ἢ ἡμιολία ἁ ΠΜ τᾶς ΠΗ, ἁ δὲ ΠΗ ἐλάσσων ἢ διπλασίων τᾶς ΗΜ Ἔστω οὖν ἁ ΠΖ τᾶς ΖΜ διπλασία.', 'οὕτως δὲ ἔχει καὶ ἡ ἀκοὴ περὶ τοὺς ψόφους·', 'δεῖ γὰρ αὐτήν τε ὑγιαίνειν καὶ τὸ μεταξὺ ἠρεμοῦν εἶναι καὶ τὸ διάστημα σύμμετρον.']
    assert my_split(input_list_5, '·') == output_5



